BusinessProcesses/ЗаявкаНаДоступ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>ЗаявкаНаДоступ</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСекретаСейфа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПодтвержденияДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекретСейф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секреты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сейфы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступСогласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/ПраваДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПраваДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокДоступа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СекретСейф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секреты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сейфы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграмм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пуш</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Календарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСокет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Действия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Действия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСекрета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаДоступ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускПриложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьСекрета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоступСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоступНеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокировкаВхода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/ЗаявкаНаДоступ/Ext/ObjectModule.bsl
Процедура ДоступПредоставленПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ДоступСогласован;
КонецПроцедуры

Процедура ОтправитьОповещениеСогласующемуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Текст = СтрШаблон("Новое согласование доступа %1 для %2", Задача.БизнесПроцесс.НаименованиеСекретаСейфа, Задача.БизнесПроцесс.Пользователь);
	ОповещенияПереопределяемый.ОповеститьПользователя(Задача.Исполнитель, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры

Процедура ДобавитьДоступПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Запись = РегистрыСведений.ПраваДоступа.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Задача.БизнесПроцесс.Пользователь;
	Запись.СекретСейф = Задача.БизнесПроцесс.СекретСейф;
	Запись.Записать();
КонецПроцедуры

Процедура ОтправитьОповещениеОРезультатеСогласованияПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Текст = "доступ согласован";
	Действие = Перечисления.Действия.ДоступСогласован;
	Если Не Задача.БизнесПроцесс.ДоступСогласован Тогда
		Текст = "доступ не согласован";
		Действие = Перечисления.Действия.ДоступНеСогласован;
	КонецЕсли;
	ИсторияДоступа.ЗалогироватьСобытие(Задача.БизнесПроцесс.СекретСейф, Действие);
	Текст = СтрШаблон("По вашей заявку на доступ %1 результат: %2", Задача.БизнесПроцесс.НаименованиеСекретаСейфа, Текст);
	ОповещенияПереопределяемый.ОповеститьПользователя(Задача.БизнесПроцесс.Пользователь, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры

Процедура СогласоватьДоступОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
КонецПроцедуры

Процедура ОтправитьОповещениеОтказСогласованияПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ОтправитьОповещениеОРезультатеСогласованияПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ);
КонецПроцедуры

Процедура ПеречитатьЛокальныйКешПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	//ЛокальноеХранилище.ОбновитьЛокальноеХранилищеСекретов("ОткрытйКлюч");
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
